import pandas as pd

# 读取xlsx文件
df = pd.read_excel('final_data.xlsx')

# 选择需要的数据，例如我们只需要'column1'和'column2'这两列
df = df[['售价', '新车售价',
         '最大马力(Ps)',
         '注册日期差（天）',
         '最大扭矩(N·m)',
         '最大功率(kW)',
         '行驶里程',
         '出厂日期差（天）',
         '高度(mm)',
         '最大功率转速(rpm)',
         '宽度(mm)',
         '轴距(mm)',
         '工信部综合油耗(L/100km)',
         '最大扭矩转速(rpm)',
         '长度(mm)',
         '后轮距(mm)',
         '整备质量(kg)',
         '行李厢容积(L)',
         '最高车速(km/h)',
         '官方0-100km/h加速(s)',
         '油箱容积(L)',
         '前轮距(mm)',
         '压缩比',
         '排量(L)',
         '商业险过期日期差（天）',
         '最小离地间隙(mm)',
         '交强险过期日期差（天）',
         '车牌所在地', '厂商', '变速箱', '燃油形式'

         ]]

# 将选择的数据保存到新的xlsx文件中
df.to_excel('new_final_data.xlsx', index=False)
